In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    'EmpCode': ['Emp001', 'Emp002', 'Emp003', 'Emp004', 'Emp005'],
    'Name': ['John', 'Doe', 'William', 'Spark', 'Mark'],
    'Occupation': ['Chemist', 'Statistician', 'Statistician',
                   'Statistician', 'Programmer'],
    'Date Of Join': ['2018-01-25', '2018-01-26', '2018-01-26', '2018-02-26',
                     '2018-03-16'],
    'Age': [23, 24, 34, 29, 40]})

In [3]:
employees

  EmpCode     Name    Occupation Date Of Join  Age
0  Emp001     John       Chemist   2018-01-25   23
1  Emp002      Doe  Statistician   2018-01-26   24
2  Emp003  William  Statistician   2018-01-26   34
3  Emp004    Spark  Statistician   2018-02-26   29
4  Emp005     Mark    Programmer   2018-03-16   40

## Droping the Row or column # axis is 0 for row and 1 for column

In [5]:
employees.drop('Age',axis=1)

  EmpCode     Name    Occupation Date Of Join
0  Emp001     John       Chemist   2018-01-25
1  Emp002      Doe  Statistician   2018-01-26
2  Emp003  William  Statistician   2018-01-26
3  Emp004    Spark  Statistician   2018-02-26
4  Emp005     Mark    Programmer   2018-03-16

In [6]:
employees.drop(4,axis=0)

  EmpCode     Name    Occupation Date Of Join  Age
0  Emp001     John       Chemist   2018-01-25   23
1  Emp002      Doe  Statistician   2018-01-26   24
2  Emp003  William  Statistician   2018-01-26   34
3  Emp004    Spark  Statistician   2018-02-26   29

## reIndex

In [20]:
employees.set_index('EmpCode')

            Name    Occupation Date Of Join  Age
EmpCode
Emp001      John       Chemist   2018-01-25   23
Emp002       Doe  Statistician   2018-01-26   24
Emp003   William  Statistician   2018-01-26   34
Emp004     Spark  Statistician   2018-02-26   29
Emp005      Mark    Programmer   2018-03-16   40

In [17]:
employees

  EmpCode     Name    Occupation Date Of Join  Age
0  Emp001     John       Chemist   2018-01-25   23
1  Emp002      Doe  Statistician   2018-01-26   24
2  Emp003  William  Statistician   2018-01-26   34
3  Emp004    Spark  Statistician   2018-02-26   29
4  Emp005     Mark    Programmer   2018-03-16   40

## Index operator [ ] only used for selecting columns, 
## loc[ ] is used for selecting subset of DataFrame means row and column both.
## iloc[ ] is used for same prpose as loc[ ] but here we give indices for selection.

In [21]:
df = pd.DataFrame([[10, 20, 30, 40], [7, 14, 21, 28], [5, 5, 0, 0]],
                  columns=['Apple', 'Orange', 'Banana', 'Pear'],
                  index=['Basket1', 'Basket2', 'Basket3'])
 
print(df)

         Apple  Orange  Banana  Pear
Basket1     10      20      30    40
Basket2      7      14      21    28
Basket3      5       5       0     0

In [31]:
df['Mean Basket'] = df.mean(axis=1)
df

         Apple  Orange  Banana  Pear  Mean Basket
Basket1     10      20      30    40         25.0
Basket2      7      14      21    28         17.5
Basket3      5       5       0     0          2.5

In [74]:
df['Apple']

Basket1       10.000000
Basket2        7.000000
Basket3        5.000000
Mean Fruit     7.333333
Name: Apple, dtype: float64

In [102]:
df['Apple']

Basket1       10.000000
Basket2        7.000000
Basket3        5.000000
Mean Fruit     7.333333
Name: Apple, dtype: float64

In [103]:
df[['Apple']]

                Apple
Basket1     10.000000
Basket2      7.000000
Basket3      5.000000
Mean Fruit   7.333333

In [100]:
df[['Apple','Banana']]

                Apple  Banana
Basket1     10.000000    30.0
Basket2      7.000000    21.0
Basket3      5.000000     0.0
Mean Fruit   7.333333    17.0

In [94]:
df.loc['Basket1':'Basket3','Apple':'Banana']

         Apple  Orange  Banana
Basket1   10.0    20.0    30.0
Basket2    7.0    14.0    21.0
Basket3    5.0     5.0     0.0

In [108]:
df.loc[['Basket1','Basket3'],['Apple','Banana']]

         Apple  Banana
Basket1   10.0    30.0
Basket3    5.0     0.0

In [109]:
df.loc[['Basket1','Basket3'],'Apple':'Banana']

         Apple  Orange  Banana
Basket1   10.0    20.0    30.0
Basket3    5.0     5.0     0.0

In [96]:
df.iloc[0:3,0:3]

         Apple  Orange  Banana
Basket1   10.0    20.0    30.0
Basket2    7.0    14.0    21.0
Basket3    5.0     5.0     0.0

In [86]:
df.loc['Basket1':'Basket3']

         Apple  Orange  Banana  Pear  Mean Basket
Basket1   10.0    20.0    30.0  40.0         25.0
Basket2    7.0    14.0    21.0  28.0         17.5
Basket3    5.0     5.0     0.0   0.0          2.5

In [87]:
df.loc['Mean Fruit'] = df.mean()

In [88]:
df

                Apple  Orange  Banana       Pear  Mean Basket
Basket1     10.000000    20.0    30.0  40.000000         25.0
Basket2      7.000000    14.0    21.0  28.000000         17.5
Basket3      5.000000     5.0     0.0   0.000000          2.5
Mean Fruit   7.333333    13.0    17.0  22.666667         15.0

In [70]:
df.iloc[:,0:3]

                Apple  Orange  Banana
Basket1     10.000000    20.0    30.0
Basket2      7.000000    14.0    21.0
Basket3      5.000000     5.0     0.0
Mean Fruit   7.333333    13.0    17.0

In [55]:
df.loc['Basket1':'Basket3']

         Apple  Orange  Banana  Pear  Mean Basket
Basket1   10.0    20.0    30.0  40.0         25.0
Basket2    7.0    14.0    21.0  28.0         17.5
Basket3    5.0     5.0     0.0   0.0          2.5

In [73]:
df.loc['Basket1':'Basket3',['Apple','Pear']]

         Apple  Pear
Basket1   10.0  40.0
Basket2    7.0  28.0
Basket3    5.0   0.0

## mean, max, sum, describe

In [110]:
df

                Apple  Orange  Banana       Pear  Mean Basket
Basket1     10.000000    20.0    30.0  40.000000         25.0
Basket2      7.000000    14.0    21.0  28.000000         17.5
Basket3      5.000000     5.0     0.0   0.000000          2.5
Mean Fruit   7.333333    13.0    17.0  22.666667         15.0

In [115]:
df.describe()

           Apple     Orange     Banana       Pear  Mean Basket
count   4.000000   4.000000   4.000000   4.000000     4.000000
mean    7.333333  13.000000  17.000000  22.666667    15.000000
std     2.054805   6.164414  12.569805  16.759740     9.354143
min     5.000000   5.000000   0.000000   0.000000     2.500000
25%     6.500000  11.000000  12.750000  17.000000    11.875000
50%     7.166667  13.500000  19.000000  25.333333    16.250000
75%     8.000000  15.500000  23.250000  31.000000    19.375000
max    10.000000  20.000000  30.000000  40.000000    25.000000

In [117]:
df['Apple'].describe()

count     4.000000
mean      7.333333
std       2.054805
min       5.000000
25%       6.500000
50%       7.166667
75%       8.000000
max      10.000000
Name: Apple, dtype: float64

In [118]:
df['Apple'].mean()

7.333333333333333

In [123]:
df.loc[:].mean()

Apple           7.333333
Orange         13.000000
Banana         17.000000
Pear           22.666667
Mean Basket    15.000000
dtype: float64

In [125]:
df.loc[:].sum()

Apple          29.333333
Orange         52.000000
Banana         68.000000
Pear           90.666667
Mean Basket    60.000000
dtype: float64

In [124]:
df['Apple'].sum()

29.333333333333332

In [127]:
df['Apple'].max()

10.0

In [128]:
df.loc[:].max()

Apple          10.0
Orange         20.0
Banana         30.0
Pear           40.0
Mean Basket    25.0
dtype: float64

In [135]:
df[['Apple','Banana']].sum()

Apple     29.333333
Banana    68.000000
dtype: float64

## reading specific columns from csv file.

In [147]:
gf = pd.read_csv("Mall_Customers.csv",usecols=['CustomerID','Genre','Age'])

In [149]:
gf.head()

   CustomerID   Genre  Age
0           1    Male   19
1           2    Male   21
2           3  Female   20
3           4  Female   23
4           5  Female   31